{
  "backend/main.mo": "Minimal Motoko actor with no functions.",
  "feature_evidence.json": "Feature evidence listing feature requirements, related files, components, and tests.",
  "frontend-file-summaries.txt": "Text file mapping frontend source paths to short functional descriptions.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color palettes using OKLCH values.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/public/vendor/lame.min.js": "Minified lamejs v1.2.0 JavaScript MP3 encoder library.",
  "frontend/src/App.tsx": "Simple React component rendering ChatScreen.",
  "frontend/src/features/chat/ChatScreen.tsx": "Main chat UI managing job creation, video fetch, conversion, progress, and error handling.",
  "frontend/src/features/chat/components/ChatComposer.tsx": "Input component for link/upload sources and format selection with validation before conversion.",
  "frontend/src/features/chat/components/ChatThread.tsx": "Renders a list of conversion jobs with status indicators, progress, and metadata, or a placeholder when no jobs exist.",
  "frontend/src/features/conversion/convertVideoToAudio.ts": "Loads lamejs and converts video audio tracks to WAV or MP3, handling encoding, validation, and progress updates.",
  "frontend/src/features/conversion/fetchVideoFromUrl.ts": "Validates and fetches a video file from a URL with error handling, CORS considerations, and filename extraction.",
  "frontend/src/features/conversion/useConversionMutation.ts": "Provides a React Query mutation wrapper for converting video files to audio formats.",
  "frontend/src/features/conversion/videoValidation.ts": "Checks whether a Blob is a valid video using signature inspection and fallback video element loading.",
  "frontend/src/features/jobs/types.ts": "Defines job types and status enums for video-to-audio conversion tasks.",
  "frontend/src/features/jobs/useJobHistory.ts": "Manages a list of conversion jobs with functions to add and update jobs.",
  "frontend/src/features/validation/urlValidation.ts": "Validates and normalizes URLs, ensuring proper HTTP/HTTPS formatting.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, logout, and identity persistence across reloads.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder indicating no backend queries are required.",
  "frontend/src/index.css": "Defines Tailwind layers and a custom OKLCH color theme for light and dark modes with global base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/types/vendor-lame.d.ts": "Provides TypeScript declarations for the lamejs MP3 encoder and its window namespace exposure.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors mapped to CSS variables, extended theming, animations, and plugins.",
  "project_state.json": "Describes project metadata, goals, features, known issues, and the app’s current state for build planning."
}