{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Feature evidence report describing two YouTube‑related UX requirements and the files implementing them.",
  "frontend-file-summaries.txt": "Prewritten summaries for all frontend source files, detailing their roles and behaviors.",
  "frontend/index.css": "Tailwind base styles and custom CSS variables defining light/dark color themes and global layout defaults.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/public/vendor/lame.min.js": "Minified lamejs v1.2.0 MP3 encoder library used for client‑side audio encoding.",
  "frontend/src/App.tsx": "Root React component that renders ChatScreen.",
  "frontend/src/features/chat/ChatScreen.tsx": "Main chat UI orchestrating job flow, restricted‑source checks, URL fetching, and conversion tasks with autoscroll handling.",
  "frontend/src/features/chat/components/ChatComposer.tsx": "Input component for link or file upload with format selection and warnings for restricted sources.",
  "frontend/src/features/chat/components/ChatThread.tsx": "React component displaying a list of conversion jobs with status indicators, or a placeholder when empty.",
  "frontend/src/features/conversion/convertVideoToAudio.ts": "Utilities to load Lame.js and convert an AudioBuffer to WAV or MP3 with validation and progress handling.",
  "frontend/src/features/conversion/fetchVideoFromUrl.ts": "Fetches a video file from a URL with validation, restricted-source checks, and filename extraction.",
  "frontend/src/features/conversion/restrictedSources.ts": "Detects restricted sources like YouTube or TikTok and provides corresponding error or warning messages.",
  "frontend/src/features/conversion/useConversionMutation.ts": "React Query mutation hook that wraps video-to-audio conversion and returns the result.",
  "frontend/src/features/conversion/videoValidation.ts": "Validates whether a Blob is a video by checking signatures or loading it in a temporary video element.",
  "frontend/src/features/jobs/types.ts": "Defines ConversionJob structure and status types for tracking video conversion tasks.",
  "frontend/src/features/jobs/useJobHistory.ts": "Manages a list of conversion jobs with functions to add and update them.",
  "frontend/src/features/validation/urlValidation.ts": "Provides URL validation and normalization utilities enforcing HTTP/HTTPS formats.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAppViewportHeight.ts": "Hook that updates a CSS variable with the current viewport height to handle mobile browser UI changes.",
  "frontend/src/hooks/useChatAutoScroll.ts": "React hook that tracks whether a scroll container is near the bottom and auto-scrolls when new content arrives. Exposes ref, scroll handler, and manual scroll-to-bottom function.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context for Internet Identity authentication using AuthClient, handling login, stored identity loading, and login state tracking. Includes a provider and hook for accessing identity-related actions and status.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder module exporting nothing, as backend methods are not used.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining color themes, dark mode, layout behavior, and utility classes.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers and loading global styles.",
  "frontend/src/types/vendor-lame.d.ts": "TypeScript declarations for the lamejs MP3 encoder and optional window.lamejs exposure.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom theme extensions using CSS variables, plugins, and responsive container settings.",
  "project_state.json": "Project metadata describing goals, known issues, features, and architectural notes for a video-to-audio conversion app."
}