{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Lists implemented features, related source files, components, and test IDs for build verification.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence summaries for all frontend source files used in the project.",
  "frontend/index.css": "Defines Tailwind layers and OKLCH-based color variables for light and dark themes.",
  "frontend/index.html": "Root HTML page loading the React app via main.tsx.",
  "frontend/public/vendor/lame.min.js": "Minified lamejs MP3 encoder library used for client-side audio encoding.",
  "frontend/src/App.tsx": "Renders ChatScreen as the app entry component.",
  "frontend/src/features/chat/ChatScreen.tsx": "Main chat UI managing job history, URL/file input, and video-to-audio conversion flow.",
  "frontend/src/features/chat/components/ChatComposer.tsx": "Input component handling URL/upload selection, format choice, validation, and triggering conversions.",
  "frontend/src/features/chat/components/ChatThread.tsx": "Renders a list of conversion jobs with status indicators, progress, and metadata, or a placeholder when empty.",
  "frontend/src/features/conversion/convertVideoToAudio.ts": "Handles WAV and MP3 audio encoding from video by dynamically loading lamejs and converting AudioBuffers.",
  "frontend/src/features/conversion/fetchVideoFromUrl.ts": "Fetches a video file from a URL with validation, CORS handling, and filename extraction.",
  "frontend/src/features/conversion/useConversionMutation.ts": "Provides a React Query mutation hook to run video-to-audio conversions and return result metadata.",
  "frontend/src/features/jobs/types.ts": "Defines types for conversion job objects and status states.",
  "frontend/src/features/jobs/useJobHistory.ts": "Maintains a local list of jobs with functions to add and update conversion job entries.",
  "frontend/src/features/validation/urlValidation.ts": "Validates and normalizes URLs using basic parsing rules.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context with login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing because backend has no callable methods.",
  "frontend/src/index.css": "Defines Tailwind CSS setup and custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/types/vendor-lame.d.ts": "Type declarations for lamejs and its Mp3Encoder for TypeScript support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, including features, requirements, and metadata for a video-to-audio conversion app."
}