{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing short descriptions of various frontend source files.",
  "frontend/index.css": "Tailwind base styles plus theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/public/vendor/lame.min.js": "Minified lamejs MP3 encoder library used for client-side audio encoding.",
  "frontend/src/App.tsx": "Renders ChatScreen as the root application component.",
  "frontend/src/features/chat/ChatScreen.tsx": "Main chat workflow handling job creation, restricted-source checks, fetching, conversion, and scroll behavior.",
  "frontend/src/features/chat/components/ChatComposer.tsx": "UI for entering URLs or uploading files, selecting format, and warning on restricted sources.",
  "frontend/src/features/chat/components/ChatThread.tsx": "Renders a list of conversion jobs with status indicators, or a placeholder UI when no jobs exist.",
  "frontend/src/features/conversion/convertVideoToAudio.ts": "Loads lame.js and converts AudioBuffer data to WAV or MP3, handling encoding, validation, and progress updates.",
  "frontend/src/features/conversion/fetchVideoFromUrl.ts": "Fetches a video file from a URL with validation, restricted-source checks, error handling, and filename extraction.",
  "frontend/src/features/conversion/restrictedSources.ts": "Detects YouTube/TikTok URLs and provides user-friendly error or warning messages for restricted sources.",
  "frontend/src/features/conversion/useConversionMutation.ts": "React Query mutation wrapper that runs video-to-audio conversion and returns the file URL and filename.",
  "frontend/src/features/conversion/videoValidation.ts": "Validates whether a Blob is a video by checking magic numbers or loading it into a temporary video element.",
  "frontend/src/features/jobs/types.ts": "Defines types for conversion jobs, including status, metadata, progress, and output fields.",
  "frontend/src/features/jobs/useJobHistory.ts": "Manages an in-memory list of conversion jobs with functions to add and update entries.",
  "frontend/src/features/validation/urlValidation.ts": "Provides URL validation and normalization utilities ensuring proper HTTP/HTTPS formatting.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useAppViewportHeight.ts": "Updates a CSS variable with the real viewport height to improve mobile layout handling.",
  "frontend/src/hooks/useChatAutoScroll.ts": "Provides a hook for detecting near-bottom scroll position and auto-scrolling a chat container when new content arrives.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements React context and provider for Internet Identity authentication, handling login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend query methods are used.",
  "frontend/src/index.css": "Defines global Tailwind layers, CSS variables for themes, dark mode overrides, and layout defaults.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/types/vendor-lame.d.ts": "Declares TypeScript types for the lamejs MP3 encoder and its global window usage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, theme extensions, plugins, and dark mode classes.",
  "project_state.json": "Tracks project metadata, features, issues, and the app’s high-level build state."
}