{
  "kind": "build_request",
  "title": "Align restricted-source messaging (YouTube/TikTok) and avoid promising that any link will work",
  "projectName": "Vid2Audio Chat",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-15",
      "text": "Ensure the YouTube restricted-source failure message shown to users is exactly: \"YouTube videos cannot be accessed directly from the browser due to CORS restrictions and anti-bot protection. Please download the video using a YouTube downloader and upload the file directly.\" and that this message is used consistently anywhere the app blocks YouTube link conversion (including early restricted-source checks and any fetch-failure classification that maps to YouTube).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "YouTube videos cannot be accessed directly from the browser due to CORS restrictions and anti-bot protection. Please download the video using a YouTube downloader and upload the file directly."
        ]
      },
      "acceptanceCriteria": [
        "When a user attempts to convert a YouTube URL (e.g., youtube.com or youtu.be), the job fails with the exact YouTube message provided (character-for-character).",
        "No other YouTube-related error shown to the user contradicts the provided message or suggests YouTube links can be fetched in-browser.",
        "All user-facing text involved in this flow remains in English."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Update the restricted-source warning text displayed in the URL input UI so it does not imply that the app can convert “any link”, and instead clearly communicates (in English) that some sources (including YouTube) commonly cannot be accessed directly in the browser and that download+upload is the expected workaround.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Specifically asked for any link to work!"
        ]
      },
      "acceptanceCriteria": [
        "When a user pastes a YouTube URL into the URL input, the inline warning is in English and clearly sets expectations that YouTube may not work via direct link due to browser restrictions, recommending download+upload.",
        "No UI copy claims or strongly implies that the app can convert any arbitrary link successfully."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components must be composed, not modified).",
    "Do not edit any frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Backend must remain single-actor; only introduce backend changes if explicitly required by the requirements."
  ],
  "nonGoals": [
    "Implementing a server-side/proxy-based workflow to make YouTube (or other restricted sources) reliably convertible by URL.",
    "Guaranteeing that all arbitrary video page links (non-direct links) will be fetchable and convertible in the browser."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Keep all user-facing text in English and avoid overpromising capabilities like 'any link will work' when browser restrictions apply."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}