{
  "kind": "build_request",
  "title": "Fix TikTok URL fetch failure messaging and MP3 conversion crash",
  "projectName": "Vid2Audio Chat",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Fix the MP3 conversion crash that can occur when converting an uploaded video file (e.g., error: \"Cannot read properties of null (reading 'copy_buffer')\") by hardening the MP3 encoding pipeline so the app either (a) successfully produces an MP3 download or (b) fails gracefully with a clear English error message (no uncaught exceptions).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Cannot read properties of null (reading 'copy_buffer'\n\nFix these errors I should have no restrictions"
        ]
      },
      "acceptanceCriteria": [
        "Uploading a video file and converting to MP3 no longer throws an uncaught exception in the UI; the job ends in either Done (with a working download) or Failed (with a user-friendly English error).",
        "The error string \"Cannot read properties of null (reading 'copy_buffer')\" is never shown to the user; it is replaced with an actionable, user-facing message.",
        "The conversion job history correctly updates status/progress during MP3 conversion and ends in a stable state (Done/Failed) without leaving the UI stuck in Processing."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Improve link-based conversion so that when a user provides a TikTok short-link URL (e.g., https://www.tiktok.com/t/ZP89Kbbbe/), the app performs a best-effort attempt to resolve the link and fetch the underlying video content (including following redirects and tolerating non-\"video/*\" content-types when the response is still a video blob), and only fails when it is truly not accessible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "https://www.tiktok.com/t/ZP89Kbbbe/\n\nUnable to access the video URL. This may be due to CORS restrictions, authentication requirements, or the link being inaccessible. Please try uploading the video file directly instead.\n...\nFix these errors I should have no restrictions"
        ]
      },
      "acceptanceCriteria": [
        "For URL conversion, the fetch flow follows redirects and attempts to fetch the final resolved URL before failing.",
        "If the fetched response is a Blob that can be converted (even when the Content-Type header is missing or is \"application/octet-stream\"), the app proceeds to conversion instead of immediately failing on strict \"video/*\" header checks.",
        "When the video cannot be accessed due to third-party restrictions (CORS/auth/anti-bot), the job ends as Failed with a clear English message explaining that the source site blocked programmatic access in the browser, and suggests alternatives (e.g., providing a direct media file URL or uploading the file) without implying a bug in the app."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Update user-facing error messages for URL fetch failures so they remain in English, are specific about what failed (invalid URL vs. fetch blocked vs. non-video response), and avoid promising \"no restrictions\" while still communicating that the app will attempt multiple strategies to access links.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Fix these errors I should have no restrictions"
        ]
      },
      "acceptanceCriteria": [
        "URL fetch errors shown in the chat thread distinguish at least: invalid URL, could not fetch due to network/CORS/auth restrictions, and fetched content not recognized as a video.",
        "No user-facing text claims that all third-party links will always be accessible; messaging is accurate and in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components); compose them from feature components instead.",
    "Do not modify frontend immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend is a single Motoko actor in backend/main.mo; only add backend changes if strictly required (this request can be satisfied on the frontend)."
  ],
  "nonGoals": [
    "Guaranteeing access to all third-party video providers/URLs (e.g., TikTok) regardless of CORS, authentication, DRM, or anti-bot restrictions.",
    "Adding third-party authentication providers beyond Internet Identity.",
    "Adding a server-side video downloader/processor pipeline (all conversion remains client-side)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}