{
  "kind": "build_request",
  "title": "Improve handling of YouTube/TikTok links that cannot be fetched in-browser",
  "projectName": "Vid2Audio Chat",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Detect YouTube and TikTok URLs early in the link-conversion flow and fail fast with a specific, English error message explaining that these sites typically cannot be fetched directly by the browser due to CORS/auth/anti-bot restrictions, and instruct the user to download the video and upload the file instead.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-msg-1"
        ],
        "quotes": [
          "It's only YouTube link tiktok link said same issue , fix it https://youtu.be/pocCdsKX21s?si=d5mz9IZWbHGEmsm2"
        ]
      },
      "acceptanceCriteria": [
        "When the user submits https://youtu.be/pocCdsKX21s?si=d5mz9IZWbHGEmsm2, the job fails quickly without waiting for a long fetch attempt.",
        "The displayed error is in English and explicitly mentions YouTube (and similarly TikTok) links are often not directly accessible from the browser due to CORS/auth/anti-bot restrictions.",
        "The error message provides a clear next step: download the video and upload it as a file to convert."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Update the URL input UI to proactively warn users (in English) when they paste a YouTube or TikTok link that the app may not be able to access it, while still allowing them to attempt conversion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-msg-1"
        ],
        "quotes": [
          "Unable to access the video... It's only YouTube link tiktok link said same issue"
        ]
      },
      "acceptanceCriteria": [
        "When a YouTube URL (youtube.com or youtu.be) is present in the URL input, the UI shows an English inline warning that YouTube links often cannot be fetched directly and suggests uploading the file.",
        "When a TikTok URL (tiktok.com) is present in the URL input, the UI shows an equivalent English inline warning.",
        "The Convert button behavior remains unchanged (users can still try), but the warning appears before they submit."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Refine link-fetch failure classification so that when a fetch fails for known restricted sources (YouTube/TikTok), the app reports the tailored guidance instead of the generic \"Unable to access the video\" message, and preserves English-only user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-msg-1"
        ],
        "quotes": [
          "Unable to access the video. The source may block browser access (CORS), require authentication, or use anti-bot protection."
        ]
      },
      "acceptanceCriteria": [
        "For YouTube/TikTok URLs that result in fetch errors, the final job error shown in the chat thread uses the tailored, source-specific guidance rather than the generic message.",
        "For non-YouTube/TikTok URLs, existing error messages remain English, specific, and continue to distinguish invalid URL vs access denied vs not found vs non-video response where possible.",
        "No user-facing error text is shown in any language other than English."
      ]
    }
  ],
  "constraints": [
    "Do not add server-side downloading or processing; the app must remain client-side for link fetching and conversion.",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (compose them instead).",
    "Keep backend as a single Motoko actor; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Bypassing YouTube/TikTok anti-bot protections or implementing a YouTube/TikTok downloader/extractor.",
    "Adding third-party APIs or external proxy services to fetch restricted video sources.",
    "Implementing server-side video conversion or storage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}