{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Vid2Audio Chat — Better handling for restricted YouTube/TikTok URL fetching",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Fail fast for YouTube/TikTok URLs during link conversion with a tailored English message directing users to download and upload instead.",
      "acceptanceCriteria": [
        "When the user submits https://youtu.be/pocCdsKX21s?si=d5mz9IZWbHGEmsm2, the job fails quickly without waiting for a long fetch attempt.",
        "The displayed error is in English and explicitly mentions YouTube (and similarly TikTok) links are often not directly accessible from the browser due to CORS/auth/anti-bot restrictions.",
        "The error message provides a clear next step: download the video and upload it as a file to convert."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/conversion/restrictedSources.ts",
          "operation": "create",
          "description": "Add URL classification helpers to detect restricted sources (YouTube/TikTok) from user input and from post-redirect/final URLs; export a small API (e.g., detectRestrictedSource(url) -> 'youtube'|'tiktok'|null) used by the link-fetch and UI layers."
        },
        {
          "path": "frontend/src/features/chat/ChatScreen.tsx",
          "operation": "modify",
          "description": "Detect YouTube/TikTok URLs before starting the fetch step in the link-conversion flow, and immediately mark the job as failed with a specific English error message instructing the user to download the video and upload the file instead (no long fetch attempt)."
        },
        {
          "path": "frontend/src/features/conversion/fetchVideoFromUrl.ts",
          "operation": "modify",
          "description": "Add an early restricted-source guard (YouTube/TikTok) using the shared helper so fetchVideoFromUrl fails fast with the tailored English guidance, without initiating fetch for those sources."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Show an inline English warning in the URL input when a YouTube or TikTok link is detected, while keeping Convert behavior unchanged.",
      "acceptanceCriteria": [
        "When a YouTube URL (youtube.com or youtu.be) is present in the URL input, the UI shows an English inline warning that YouTube links often cannot be fetched directly and suggests uploading the file.",
        "When a TikTok URL (tiktok.com) is present in the URL input, the UI shows an equivalent English inline warning.",
        "The Convert button behavior remains unchanged (users can still try), but the warning appears before they submit."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/chat/components/ChatComposer.tsx",
          "operation": "modify",
          "description": "Use the shared restricted-source URL detection helper to show an inline warning when the current URL looks like YouTube or TikTok, while still enabling the existing Convert flow. Use shadcn-ui's Alert component to present the warning consistently (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/features/conversion/restrictedSources.ts",
          "operation": "modify",
          "description": "Ensure the restricted-source helper covers the required host patterns (youtube.com, youtu.be, tiktok.com) so the composer can warn proactively and consistently."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Classify link-fetch failures so YouTube/TikTok errors show tailored guidance instead of the generic message, keeping all user-facing text English-only.",
      "acceptanceCriteria": [
        "For YouTube/TikTok URLs that result in fetch errors, the final job error shown in the chat thread uses the tailored, source-specific guidance rather than the generic message.",
        "For non-YouTube/TikTok URLs, existing error messages remain English, specific, and continue to distinguish invalid URL vs access denied vs not found vs non-video response where possible.",
        "No user-facing error text is shown in any language other than English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/conversion/fetchVideoFromUrl.ts",
          "operation": "modify",
          "description": "Refine fetch error handling to prefer the YouTube/TikTok tailored guidance when the original URL or final/redirected URL is a restricted source (including TypeError/network failures), while preserving existing English error distinctions for non-restricted sources."
        },
        {
          "path": "frontend/src/features/chat/ChatScreen.tsx",
          "operation": "modify",
          "description": "Ensure job failure messages shown in the chat thread use the refined, source-specific error text for YouTube/TikTok fetch failures (propagate thrown messages as-is) and keep fallback error strings English-only."
        }
      ]
    }
  ]
}