{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix URL fetch messaging + harden MP3 conversion for Vid2Audio Chat",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Harden client-side MP3 encoding so conversion never crashes and always ends in Done (download) or Failed (friendly English error) with stable progress updates.",
      "acceptanceCriteria": [
        "Uploading a video file and converting to MP3 no longer throws an uncaught exception in the UI; the job ends in either Done (with a working download) or Failed (with a user-friendly English error).",
        "The error string \"Cannot read properties of null (reading 'copy_buffer')\" is never shown to the user; it is replaced with an actionable, user-facing message.",
        "The conversion job history correctly updates status/progress during MP3 conversion and ends in a stable state (Done/Failed) without leaving the UI stuck in Processing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/conversion/convertVideoToAudio.ts",
          "operation": "modify",
          "description": "Add defensive checks and error hardening around AudioBuffer decoding and MP3 encoding (guard unsupported channel/sample-rate cases, wrap/normalize lamejs failures, ensure URL.revokeObjectURL and AudioContext cleanup in finally). Ensure any internal exceptions (including copy_buffer-related crashes) are converted into clear English user-facing errors and never leak raw internal messages; keep onProgress updates consistent so the UI reaches a terminal Done/Failed state."
        },
        {
          "path": "frontend/src/features/chat/ChatScreen.tsx",
          "operation": "modify",
          "description": "Ensure conversion failures from the MP3 pipeline are surfaced as user-friendly English messages and that job status/progress always transitions to a terminal state (done/failed) without leaving jobs stuck in converting; avoid displaying raw internal exception strings to the user."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Improve TikTok short-link and general URL-based conversion by best-effort redirect resolution and tolerant video blob handling before failing.",
      "acceptanceCriteria": [
        "For URL conversion, the fetch flow follows redirects and attempts to fetch the final resolved URL before failing.",
        "If the fetched response is a Blob that can be converted (even when the Content-Type header is missing or is \"application/octet-stream\"), the app proceeds to conversion instead of immediately failing on strict \"video/*\" header checks.",
        "When the video cannot be accessed due to third-party restrictions (CORS/auth/anti-bot), the job ends as Failed with a clear English message explaining that the source site blocked programmatic access in the browser, and suggests alternatives (e.g., providing a direct media file URL or uploading the file) without implying a bug in the app."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/conversion/fetchVideoFromUrl.ts",
          "operation": "modify",
          "description": "Implement a best-effort URL fetch strategy tailored for short-links: follow redirects (and, when possible, retry using the resolved final URL), tolerate missing/opaque Content-Type by validating via blob inspection/playability checks, and only fail when the content is truly not accessible or not a video. Map third-party blocking cases (CORS/auth/anti-bot) to a clear English message explaining browser limitations and suggesting alternatives (direct media URL or upload)."
        },
        {
          "path": "frontend/src/features/conversion/videoValidation.ts",
          "operation": "create",
          "description": "Add helper(s) to determine whether a fetched Blob is likely a playable video (e.g., by attempting to load metadata via a temporary HTMLVideoElement using an object URL and/or lightweight signature checks) so the app can proceed when Content-Type is missing or generic."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Update user-facing URL fetch failure messaging to be specific (invalid URL vs blocked vs not-video), accurate, and consistently English without claiming universal access.",
      "acceptanceCriteria": [
        "URL fetch errors shown in the chat thread distinguish at least: invalid URL, could not fetch due to network/CORS/auth restrictions, and fetched content not recognized as a video.",
        "No user-facing text claims that all third-party links will always be accessible; messaging is accurate and in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/conversion/fetchVideoFromUrl.ts",
          "operation": "modify",
          "description": "Refine thrown errors into distinct, user-facing English messages for: invalid URL, fetch blocked (network/CORS/auth/anti-bot), fetch failed (HTTP not OK), and non-video/not-recognized content. Ensure messages are accurate (no promises of universal access) while stating the app will attempt multiple strategies (redirect follow + tolerant blob handling)."
        },
        {
          "path": "frontend/src/features/chat/ChatThread.tsx",
          "operation": "modify",
          "description": "Ensure the chat thread displays the improved, specific English error messages for URL fetch failures cleanly (invalid URL vs blocked vs not-video) and does not show any misleading text implying all links are always accessible."
        },
        {
          "path": "frontend/src/features/validation/urlValidation.ts",
          "operation": "modify",
          "description": "Optionally strengthen URL normalization/validation behavior used by the composer and fetch flow (trim/normalize consistently) to reduce false negatives and support clearer invalid-URL messaging while keeping the UI error text in English."
        }
      ]
    }
  ]
}