{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Align restricted-source messaging for YouTube/TikTok and avoid overpromising link support",
  "requirements": [
    {
      "id": "REQ-15",
      "summary": "Use the exact provided YouTube restricted-source failure message everywhere the app blocks YouTube URL conversion (early checks and fetch-failure classification).",
      "acceptanceCriteria": [
        "When a user attempts to convert a YouTube URL (e.g., youtube.com or youtu.be), the job fails with the exact YouTube message provided (character-for-character).",
        "No other YouTube-related error shown to the user contradicts the provided message or suggests YouTube links can be fetched in-browser.",
        "All user-facing text involved in this flow remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/conversion/restrictedSources.ts",
          "operation": "modify",
          "description": "Centralize the YouTube restricted-source failure copy into a single exported constant (exactly: \"YouTube videos cannot be accessed directly from the browser due to CORS restrictions and anti-bot protection. Please download the video using a YouTube downloader and upload the file directly.\") and ensure getRestrictedSourceError('youtube') returns that constant so every caller shows the identical message."
        },
        {
          "path": "frontend/src/features/conversion/fetchVideoFromUrl.ts",
          "operation": "modify",
          "description": "Audit and adjust error mapping so any restricted-source detection/classification that resolves to YouTube always throws the YouTube message from getRestrictedSourceError('youtube') (no alternative YouTube-specific failure strings)."
        },
        {
          "path": "frontend/src/features/chat/ChatScreen.tsx",
          "operation": "modify",
          "description": "Confirm the early restricted-source check and any link-conversion failure handling paths display the YouTube message via getRestrictedSourceError('youtube') and do not introduce any contradictory YouTube-specific copy."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Update the URL input inline restricted-source warning so it does not imply “any link” will work and clearly recommends download+upload for sources like YouTube blocked in-browser.",
      "acceptanceCriteria": [
        "When a user pastes a YouTube URL into the URL input, the inline warning is in English and clearly sets expectations that YouTube may not work via direct link due to browser restrictions, recommending download+upload.",
        "No UI copy claims or strongly implies that the app can convert any arbitrary link successfully."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/conversion/restrictedSources.ts",
          "operation": "modify",
          "description": "Revise getRestrictedSourceWarning('youtube') (and keep other warnings consistent) to clearly state in English that some sources (including YouTube) commonly cannot be accessed directly in the browser due to restrictions and that download+upload is the expected workaround."
        },
        {
          "path": "frontend/src/features/chat/components/ChatComposer.tsx",
          "operation": "modify",
          "description": "Update the URL input UI logic so the restricted-source inline warning reliably appears when a user pastes a YouTube URL (even if missing a scheme), and ensure the warning copy does not imply the app can convert “any link” successfully."
        }
      ]
    }
  ]
}